package com.amou.traditionalsongs.values;

import com.amou.traditionalsongs.databases.DatabaseHelper;

/**
 * Created by dimitrios on 18/12/2015.
 */
public class SongValues {

    public static String getSongs()
    {
        return "INSERT INTO `"+ DatabaseHelper.DATABASE_SONGS+"` (`id`, `region_id`, `area_id`, `title`, `description`, `lyrics`, `has_lyrics`, `has_dance`) VALUES"+
            "(1, 11, 1, 'Στο Σαλονίκη στα τσαρσιά', 'Παραδοσιακό Μακεδονικό τραγούδι από την κωμόπολη Άσσηρος της περιοχής της Θεσσαλονίκης. Το συγκεκριμένο τραγούδι, απαντάται σε πολλές και διαφορετικές παραλλαγές στην περιοχή της Μακεδονίας, της Θράκης αλλά και της Θεσσαλίας. Είναι σε 7σημο ρυθμό (τύπου ράικο ή τρεχάτος) και χορεύεται στα τρία, με μια ρυθμική όμως κίνηση των χεριών. Το γύρισμα στο βίντεο, ο οργανικός επτάσημος σκοπός δηλαδή, ονομάζεται Λαγκάζ(α) βασού ή Λαγκάζα χαβασί, δηλαδή Λαγκαδιώτικος σκοπός (από την κωμόπολη του Λαγκαδά).', 'Τρία τουφέκια βρόντηξαν, τα τρία αράδα αράδα\r\nτο ''να τουν παίρνει στην μεριά, και τ'' άλλο πίσ'' στην πλάτη\r\nΤο τρίτο το φαρμακερό, κατάκαρδα τουν παίρνει. \r\n\r\nΣτο Σαλονίκ'' - βρε βασιλικέ μ'' - στο Σαλονίκι στα τσιαρσιά\r\nστης πόλης τ'' αργαστήρια, Λένη μου καμαρουμένη\r\nστης πόλης τ'' αργαστήρια, βρε βασιλικέ μ'' καημένε.\r\n\r\nΤρία τουφέ - βρε βασιλικέ μ'' - Τρία τουφέκια βρόντηξαν\r\nτα τρία αράδα αράδα, Λένη μου καμαρουμένη\r\nτα τρία αράδα αράδα, βρε βασιλικέ μ'' καημένε\r\n\r\nτο ''να τουν παίρν - βρε βασιλικέ μ'' - το ''να τουν παίρνει στην μεριά\r\nκαι τ'' άλλο πίσ'' στην πλάτη, Λένη μου καμαρουμένη\r\nκαι τ'' άλλο πίσ'' στην πλάτη, βρε βασιλικέ μ'' καημένε\r\n\r\nΤο τρίτο το  βρε βασιλικέ μ'' - Το τρίτο το φαρμακερό\r\nκατάκαρδα τουν παίρνει, Λένη μου καμαρουμένη\r\nκατάκαρδα τουν παίρνει, βρε βασιλικέ μ'' καημένε', 'Y', 'Y'),"+
        "(2, 11, 1, 'Ας χαμηλώναν τα βουνά', '', 'Άιντε ας χαμηλώ ας χαμηλώναν τα βουνά, αμάν ας χαμη\\n\r\nΆιντε ας χαμηλώ ας χαμηλώναν τα βουνά\\n\r\nΆιντε να ιδώ την Σαλονίκη τα μεσάνυχτα τν πόρτα σου άνοιξα\\n\r\nΜήλο της μηλιάς, κορμί της αγκαλιάς\r\n\\n\\n\r\nΆιντε να ιδώ και την, να ιδώ και την αγάπη μου, αμάν να ιδώ και\\n\r\nΆιντε να ιδώ και την, να ιδώ και την αγάπη μου\\n\r\nΆιντε με ποιον ασίκη παίζει κόρη μ'' έμορφη ας ήσουν εύκαιρη\\n\r\nΜήλο μ'' κόκκινο, κορμί', 'Y', 'Y'),"+
        "(4, 11, 1, 'Λενιώ', '', 'Ποψι ''να μαρί Λινιώ, ποψι μι του φεγγαράκι\r\nποψι μι του  φιγγαράκι, πα''ιρνου ένα στινο σουκάκι\r\n\r\nΠαίρνου ''να μαρί Λινιώ, παίρνου ενα στινό σουκάκι\r\nπαίρνου ένα στινό σουκάκι, βρίσκου ένα παραθυράκι\r\n\r\nΒρίσκου ''να μαρί Λινιώ, βρίσκου ένα παραθυράκι\r\nβρίσκου ένα παραθυράκι, σκύφτου παίρνου ένα πιτράκι\r\n\r\nΣκύφτου ''να μαρί Λινιώ, σκύφτου παίρνου ένα πιτράκι\r\nσκύφτου παίρνου ένα πιτράκι, κρούγου του παραθυράκι\r\n\r\nΚρούγου ''να μαρί Λινιώ, κρούγου του παραθυράκι\r\nκρούγου του παραθυράκι, βγαίνει εν'' άσπρου κουριτσάκι\r\n\r\nΒγαίνει ''να μαρί Λινιώ, βγαίνει εν'' άσπρου κουριτσάκι\r\nβγαίνει εν'' άσπρου κουριτσάκι, άσπρο ήταν σαν μπαμπάκι\r\n\r\nΆσπρο ''να μαρί Λινιώ, άσπρο ήταν σαν μπαμπάκι\r\nάσπρο ήταν σαν μπαμπάκι,και λιγνό σαν ζαμπάκι', 'Y', 'Y');";
    }
}
